export const roadsData = [
    {
      id: 1,
      name: 'Дорога 1',
      coordinates: [
        { lat: 50.906, lng: 34.793991999999996 },
        // Добавьте здесь другие координаты для Дороги 1
      ],
    },
    {
      id: 2,
      name: 'Дорога 2',
      coordinates: [
        { lat: 51.0, lng: 34.8 },
        // Добавьте здесь другие координаты для Дороги 2
      ],
    },
    {
      id: 3,
      name: 'Дорога 3',
      coordinates: [
        { lat: 50.95, lng: 34.85 },
        // Добавьте здесь другие координаты для Дороги 3
      ],
    },
    // Добавьте здесь другие дороги по аналогии
  ];
  